"""
Standard American Convention

На вход программе подаётся натуральное число. Напишите программу, которая
вставляет в заданное число запятые в соответствии со стандартным американским
соглашением о запятых в больших числах.

Формат входных данных
На вход программе подается натуральное число n (0<n<10^100).

Формат выходных данных
Программа должна вывести число с запятыми в соответствии с условием задачи.
"""

print(f"{int(input()):,}")
